
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/takahiro-impara/pd-iac/actions/runs/8220186325)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # pagerduty_user.pd_user["imparapoc03@gmail.com"] will be created
  + resource "pagerduty_user" "pd_user" {
      + avatar_url      = (known after apply)
      + color           = (known after apply)
      + description     = "Managed by Terraform"
      + email           = "imparapoc03@gmail.com"
      + html_url        = (known after apply)
      + id              = (known after apply)
      + invitation_sent = (known after apply)
      + license         = (known after apply)
      + name            = "Poc User"
      + role            = "limited_user"
      + teams           = (known after apply)
      + time_zone       = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
pagerduty_user.pd_user["imparapoc03@gmail.com"]: Creating...
pagerduty_user.pd_user["imparapoc03@gmail.com"]: Creation complete after 1s [id=POCJ4A2]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":1,"Program":"tfcmt","SHA1":"bf7d387dde28e4f057e6082927f1c2a442411dd7","Vars":{},"WorkflowName":"Plan"} -->